; =================================================================
;                       MATH LIBRARY
; =================================================================

section .text
    global sys_sin
    global sys_cos
    global sys_tan
    global sys_ctg
    global sys_log

; *****************************************************************
;                          SINE 
; *****************************************************************

sys_sin:
    fild qword [rsp + 8]    ; Загружаем целое число в FPU
    fsin                    ; Считаем синус (получаем дробь в ST0)
    fistp qword [rsp + 8]   ; Округляем до целого и сохраняем обратно в стек CPU
    ret



; *****************************************************************
;                         COSINE 
; *****************************************************************

sys_cos:
    fild qword [rsp + 8]
    fcos
    fistp qword [rsp + 8]
    ret



; *****************************************************************
;                        TANGENT 
; *****************************************************************

sys_tan:
    fild qword [rsp + 8]
    fptan                   ; ST0 = 1.0, ST1 = tan(X)
    fstp st0                ; Убираем 1.0, теперь tan(X) в ST0
    fistp qword [rsp + 8]   ; Округляем до целого и сохраняем
    ret



; *****************************************************************
;                       COTANGENT 
; *****************************************************************

sys_ctg:
    fild qword [rsp + 8]
    fptan                   ; ST0 = 1.0, ST1 = tan(X)
    fdivrp st1, st0         ; ST1 = 1.0 / tan(X). Результат в ST0
    fistp qword [rsp + 8]   ; Округляем до целого и сохраняем
    ret



; *****************************************************************
;                   NATURAL LOGARITHM
; *****************************************************************

sys_log:
    fldln2                  ; Загружаем ln(2) в ST0
    fild qword [rsp + 8]    ; Загружаем целое число из стека памяти в ST0 (ln(2) уходит в ST1)
    fyl2x                   ; Считаем ST1 * log2(ST0) = ln(X)
    fistp qword [rsp + 8]   ; Округляем до целого и сохраняем
    ret